'''

Завдання 3
Запитайте в користувача введення оцінок студентів через пробіл (наприклад, "85 90 78").
У блоці try перетворити рядок в список чисел і обчислити середнє значення.
Обробіть ValueError, якщо будь-яке значення не вдається перетворити, і ZeroDivisionError, якщо список оцінок виявиться порожнім.
У блоці finally виведіть повідомлення "Завершення обчислень".


'''

try:
    user_list = input("Введите свои оценки через пробел --> ")

    grades = [int(x)
    for x in user_list.split()]

    avg = sum(grades) / len(grades)

except ValueError:
    print("Вы ввели не число")
except ZeroDivisionError:
    print("У вас нету оценок")

finally:
    print(f"-----SUMMARY-----\n Ваша средняя оценка: {avg} \n Ваши оценки: {grades} ")