'''

Завдання 4
Розробіть симулятор банкомату, де у користувача запитується сума для зняття.
У блоці try отримайте суму, перетворіть її на число і перевірте, що сума кратна 10 і не перевищує заданий баланс (наприклад, 1000).
Обробіть ValueError, якщо введення некоректне.
Якщо сума не відповідає вимогам, за допомогою raise згенеруйте виняток (наприклад, raise Exception("Некоректна сума для зняття")) і обробіть його в блоці except.
У блоці finally виведіть повідомлення про завершення транзакції.


'''

try:
    import time
    line = "-" * 50
    status = ""
    user_bal = 0
    result = 0
    print(line)
    print("Здравствуйте вас приветствует Приват24\n Введите номер вашей карточки (1)")
    card = input("-> ")

    if card == "1":
        balance = 1500

        user_bal = int(input(f"Сколько хотите вывести? Вам доступно {balance}-> "))

        if user_bal <= 0:
            print("Простите вы не можете вывести 0")
            status = "Не-Успешно"

        elif user_bal > balance:
            print("Недостаточно Средств")
            status = "Не-Успешно"
        else:
            print("Ожидайте...")
            time.sleep(1)

            result = user_bal - balance


    else:
        print("Простите мы не можем обслуживать клиентов чужих банков")
        status = "Не-Успешно"

except Exception as ex:
    print(ex)
    status = "Не-Успешно"
finally:
    print(f'{line}\n\t\tЧЕК\n Сумма вывода: {user_bal}\n Код Операции: {status} \n Остаток баланса: {result} ')