'''

Завдання 5
Запитайте в користувача введення номера замовлення.
У блоці try перевірте, що номер замовлення починається з "ORD" і містить після цього цифри.
Якщо формат неправильний, за допомогою raise згенеруйте виняток (raise Exception("Неправильний формат номера замовлення")).
Обробіть виняток у блоці except і виведіть зрозуміле повідомлення.
У блоці finally виведіть повідомлення про завершення перевірки.


'''

try:
    order_num = input("Введите номер заказа -> ")

    if not order_num.startswith("ORD") or not order_num[3:].isdigit():
        raise Exception("Неправильний формат номера заказа")

    print("найден заказ:", order_num)

except Exception as ex:
    print("Ошибка:", ex)

finally:
    print("Спасибо что воспользовались нашими услугами НоваПошта")