'''

Завдання 6
Попросіть користувача ввести послідовність чисел через пробіл.
У блоці try перетворіть рядок на список.
В циклі для кожного елемента використовуйте вкладений блок try для перетворення на число.
Обробляючи ValueError для некоректних значень з виведенням попередження і пропуском таких елементів.
Після успішного перетворення обчисліть суму і середнє значення. Обробіть ZeroDivisionError, якщо список виявився порожнім.
У блоці finally виведіть повідомлення про завершення обробки даних.

'''


num = float(input('Введите число ( через пробел )-> '))
try:
    numbers = num.split()
    numbers = [float(number) for number in numbers]
    average = sum(numbers) / len(numbers)
    print(f'Среднее число: {average}')
except ValueError:
    print("Неизвестное Число")
except ZeroDivisionError:
    print('Нельзя делить на 0')
finally:
    print('Спасибо что выбрали нас ( я не смог придумать компанию) ')