'''


Користувач вводить із клавіатури число в діапазоні від 1 до 100.
● Якщо число кратне 3 (ділиться на 3 без залишку) потрібно
вивести слово Fizz.
● Якщо число кратне 5 потрібно вивести слово Buzz. Якщо число
кратне 3 і 5 потрібно вивести Fizz Buzz.
● Якщо число не кратне не 3 і 5 потрібно вивести саме число.
● Якщо користувач ввів значення не в діапазоні від 1 до 100
потрібно вивести повідомлення про помилку.


'''

user_num = int(input("Введите число между 1 - 100 -->"))

if user_num > 0 and user_num <= 100:
    pass

    if user_num % 3 == 0:
        print("Fizz")
    elif user_num % 5 == 0:
        print("Fizz Buzz")
    else:
        print(user_num)




else:
    print("Внимание уведомление, вы не умеете читать.")