'''

Два списки цілих заповнюються випадковими числами. Необхідно:
● Сформувати третій список, що містить елементи обох списків;
● Сформувати третій список, що містить елементи обох списків без повторень;
● Сформувати третій список, що містить елементи спільні для двох списків;
● Сформувати третій список, що містить тільки унікальні елементи кожного зі
списків;
● Сформувати третій список, що містить тільки мінімальне і максимальне
значення кожного зі списків.

'''

numbers = [5, 9, 2, 4, 6, 3, 7, 8]
numbers2 = [1, 4, 3, 2, 5, 6, 7, 8]

print(f"Список 1: {numbers}")
print(f"Список 2: {numbers2}")
print("------------------------------------------------")

# Метод min дает самый маленький элемент из переменной а max самый большой
# Метод set создаст новый список из другого списка. List ну он делает из обьектов список если кратко

list1 = numbers + numbers2
print(list1)

list2 = list(set(numbers + numbers2))
print(list2)

list3 = list(set(numbers) & set(numbers2))
print(list3)

list4 = list(set(numbers) ^ set(numbers2))
print(list4)

list5 = [min(numbers), max(numbers), min(numbers2), max(numbers2)]
print(list5)
