'''

Завдання 6
Напишіть функцію, яка перевіряє, чи є шестизначне число "щасливим".
Число передається як параметр. Якщо число щасливе потрібно повернути з функції true, інакше false.
"Щасливе шестизначне число " — це число, у якого сума перших трьох цифр дорівнює сумі трьох других цифр.
Наприклад, 123420 — щасливе 1+2+3 = 4+2+0, а 723422 — нещасливе 7+2+3 != 4+2+2.

'''

def is_lucky(n):
    s = str(abs(n))

    if len(s) != 6:
        return False

    left = int(s[0]) + int(s[1]) + int(s[2])
    right = int(s[3]) + int(s[4]) + int(s[5])

    return left == right