#Користувач вводить загальну суму рахунку в ресторані та кількість
#осіб, які будуть ділити рахунок. Напишіть програму, яка розраховує
#суму чайових (15% від загальної суми) і загальну суму, включаючи
#чайові. Потім програма повинна розділити загальну суму з чайовими
#на кількість осіб і вивести, скільки кожна людина має заплатити.

receipt = float( input("Полный счёт:"))
guests = float( input("кол.во гостей:"))

tips = (receipt*0.15)

full_price = (tips+receipt)

indiv_receipt = (full_price/guests)

print(indiv_receipt,"с каждого")