#Користувач вводить вартість оренди автомобіля за день, кількість
#днів оренди та суму застави, яку потрібно внести. Напишіть
#програму, яка розраховує загальну вартість оренди (з урахуванням
#застави) і виводить суму, яку необхідно заплатити користувачеві
#після повернення автомобіля (припускаючи, що застава
#повертається повністю). Програма повинна також розділити
#підсумкову суму оренди (без застави) на кількість днів і вивести
#вартість оренди за один день

rent_price = float( input("Аренда авто за 1 день:"))
days = float( input("Кол.во дней на аренду:"))
pledge = float( input("Залог:"))


rent_cost = (rent_price*days)
full_cost = (rent_cost+pledge)
daily_cost = (rent_cost/days)

days = int(days)

print(daily_cost, "дневная сумма аренды")
print(full_cost,"Аренда за",days,"дней")