#Користувач вводить з клавіатури три числа. Перше число - зарплата
#за місяць, друге число — сума щомісячного платежу за кредитом у
#банку, третє число — заборгованість за комунальні послуги.
#Необхідно вивести на екран суму, яка залишиться у користувача
#після всіх виплат.


wages = float( input("Зарплата в месяц:"))
loan_pay = float( input("Ежемесячный платёж по кредиту:"))
money_owed = float( input("Деньги задолженные комунальным службам:"))

ans = (wages - loan_pay )
ans = (ans - money_owed)

print(ans, "гривен осталось")