'''

Завдання 2
Створіть програму, у якій заздалегідь задано список (наприклад, [10,
20, 30, 40, 50]).
● Запитайте в користувача введення індексу елемента, який
необхідно витягти.
● У блоці try перетворіть введення в число і виведіть елемент
списку за вказаним індексом.
● Перехопіть ValueError (якщо індекс не є числом) і IndexError
(якщо індекс виходить за межі списку).
● У блоці finally виведіть повідомлення про завершення операції.

'''


my_list = [10, 20, 30, 40, 50]
print(f"Список: {my_list}")

try:
    user_input = input("Введите число ( отсчет начинается с 0 ): ")
    index = int(user_input)
    element = my_list[index]
    print(f"Число под номером {index}: {element}")

except ValueError:
    print("Вы ввели не число")

except IndexError:
    print(f"Ваше число выше или меньше за список {-len(my_list)} до {len(my_list) - 1}.")

finally:
    print("КОд завершен.")
