'''

Завдання 5
Попросіть користувача ввести дані про товар у форматі: назва, ціна,
кількість (наприклад, "Хліб, 1.5, 10").
У блоці try розділіть рядок по комах і спробуйте перетворити
ціну та кількість на числа.
Якщо перетворення не вдається, перехопіть ValueError для цієї
операції, виведіть попередження і завершіть обробку.
У блоці finally виведіть повідомлення про завершення парсингу

'''


data = input("Введите данные товара(Название, Цена, Кол.Во): ")

try:
    name, price_str, quantity_str = map(str.strip, data.split(','))

    price = float(price_str)
    quantity = int(quantity_str)

    print(f"\nТовар добавлен: '{name}'  ")
    print(f"Цена: {price}, Кол.Во: {quantity}")

except ValueError:
    print("\nВы ввели не число")

except ValueError as e:
    print(f"\nВы ввели по заданному правилу->{e}")

finally:
    print("Код завершен")
